app/Http/Controllers/User/AuthorizationController.php

select * from `basic_settings` limit 1
---
    public function showKycFrom() {
        $basic_settings   = BasicSettings::first();