app/Http/Controllers/User/BuyCryptoController.php

select * from `currencies` where `status` = 1 order by `id` asc
select * from `currencies` where `status` = 1 limit 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'payment-method' and `status` = 1)
---
    public function index(){
        $page_title         = "- Buy Crypto";
        $currencies         = Currency::with(['networks'])->where('status',true)->orderBy('id')->get();
        $first_currency     = Currency::where('status',true)->first();
        $payment_gateway    = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::payment_method_slug());
            $gateway->where('status', 1);
        })->get();

select * from `currencies` where `currencies`.`id` = '1' limit 1
select * from `networks` where `networks`.`id` in (4, 5)
---
    public function getCurrencyNetworks(Request $request){
        $validator    = Validator::make($request->all(),[
            'currency'  => 'required|integer',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors()->all());
        }

        $currency  = Currency::with(['networks' => function($network) {
            $network->with(['network']);
        }])->find($request->currency);

select * from `networks` where `id` = '5' limit 1
select * from `currency_has_networks` where `currency_id` = 1 and `network_id` = 5 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (2) order by `id` desc
select * from `currencies` where `currencies`.`id` = 1 limit 1
---
    public function store(Request $request){
        if($request->wallet_type == global_const()::INSIDE_WALLET){
            $validator  = Validator::make($request->all(),[
                'sender_currency'   => 'required',
                'network'           => 'required',
                'amount'            => 'required',
                'payment_method'    => 'required'
            ]);
            if($validator->fails()){
                return back()->withErrors($validator)->withInput($request->all());
            }
            $validated          = $validator->validate();
            $wallet_currency    = $validated['sender_currency'];
            $amount             = $validated['amount'];

            $user_wallet  = UserWallet::auth()->whereHas("currency",function($q) use ($wallet_currency) {
                $q->where("id",$wallet_currency)->active();
            })->active()->first();


            if(!$user_wallet){
                return back()->with(['error' => ['Wallet not found!']]);
            }

            $network        = Network::where('id',$validated['network'])->first();
            $network_info   = CurrencyHasNetwork::where('currency_id',$user_wallet->currency->id)->where('network_id',$network->id)->first();

            $payment_gateway_currency   = PaymentGatewayCurrency::with(['gateway'])->where('id',$validated['payment_method'])->first();

select * from `temporary_datas` where `identifier` = 'ba539c51-8c75-43da-a87f-eaea6dc47c4c' limit 1
---
    public function preview($identifier){
        $page_title     = "- Buy Crypto Preview";
        $data           = TemporaryData::where('identifier',$identifier)->first();

select * from `temporary_datas` where `type` = 'Buy Crypto' and `identifier` = '1VD53189PS536270V' limit 1
select exists(select * from `transactions` where `callback_ref` = '1VD53189PS536270V') as `exists`
---
    public function success(Request $request, $gateway){

        try{
            $token = PaymentGatewayHelper::getToken($request->all(),$gateway);
            $temp_data = TemporaryData::where("type",PaymentGatewayConst::BUY_CRYPTO)->where("identifier",$token)->first();


            if(Transaction::where('callback_ref', $token)->exists()) {

select * from `basic_settings` limit 1
select * from `temporary_datas` where `identifier` = 'TCAEuttz3trljP53KckRgKeH9Jr3EtXyPQzBapFOW5' limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 6 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (8) order by `id` desc
select * from `user_wallets` where `user_wallets`.`id` = 1 limit 1
---
    public function manualSubmit(Request $request,$token) {
        $basic_setting = BasicSettings::first();
        $user          = auth()->user();

        $request->merge(['identifier' => $token]);
        $tempDataValidate = Validator::make($request->all(),[
            'identifier'        => "required|string|exists:temporary_datas",
        ])->validate();

        $tempData = TemporaryData::search($tempDataValidate['identifier'])->first();

        if(!$tempData || $tempData->data == null || !isset($tempData->data->gateway_currency_id)) return redirect()->route('user.buy.crypto.index')->with(['error' => ['Invalid request']]);
        $gateway_currency = PaymentGatewayCurrency::find($tempData->data->gateway_currency_id);
        if(!$gateway_currency || !$gateway_currency->gateway->isManual()) return redirect()->route('user.buy.crypto.index')->with(['error' => ['Selected gateway is invalid']]);
        $gateway = $gateway_currency->gateway;
        $amount = $tempData->data->amount ?? null;
        if(!$amount) return redirect()->route('user.buy.crypto.index')->with(['error' => ['Transaction Failed. Failed to save information. Please try again']]);
        $wallet = UserWallet::find($tempData->data->wallet_id ?? null);