app/Http/Controllers/User/ExchangeCryptoController.php

select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4)
select * from `user_wallets` where `user_id` = 1 order by `id` asc
select * from `transaction_settings` where `slug` = 'exchange' limit 1
---
    public function index(){
        $page_title         = "- Exchange Crypto";
        $currencies         = UserWallet::auth()->with(['currency'])->get();
        $transaction_fees   = TransactionSetting::where('slug','exchange')->first();

select * from `currencies` where `currencies`.`id` = 1 limit 1
---
    public function store(Request $request){
        $validator   = Validator::make($request->all(),[
            'send_amount'       => 'required',
            'sender_wallet'     => 'required',
            'receive_money'     => 'required',
            'receiver_currency' => 'required',
        ]);
        if($validator->fails()){
            return back()->withErrors($validator)->withInput($request->all());
        }
        $validated                  = $validator->validate();
        $send_amount                = $validated['send_amount'];
        $sender_wallet              = $validated['sender_wallet'];
        $receiver_wallet            = $validated['receiver_currency'];
        $validated['identifier']    = Str::uuid();

        if($sender_wallet == $receiver_wallet ){
            return back()->with(['error' => ['You cannot exchange crypto using the same wallet']]);
        }
        $send_wallet        = UserWallet::auth()->whereHas("currency",function($q) use ($sender_wallet) {
            $q->where("id",$sender_wallet)->active();
        })->active()->first();

        if(!$send_wallet){
            return back()->with(['error' => ['Sender Wallet not found!']]);
        }

        if($send_amount > $send_wallet->balance){
            return back()->with(['error' => ['Sorry! Insufficient Balance.']]);
        }
        $receive_wallet     = UserWallet::auth()->whereHas("currency",function($q) use ($receiver_wallet) {
            $q->where("id",$receiver_wallet)->active();
        })->active()->first();

select * from `transaction_settings` where `slug` = 'exchange' limit 1
---
        $receiver_rate      = $receive_wallet->currency->rate;
        $exchange_rate      = $receiver_rate / $sender_rate;
        $amount             = $send_amount * $exchange_rate;
        $transaction_fees   = TransactionSetting::where('slug','exchange')->first();