app/Http/Controllers/User/SecurityController.php

    public function google2FAStatusUpdate(Request $request) {
        $validated = Validator::make($request->all(),[
            'target'        => "required|numeric",
        ])->validate();

        $user = auth()->user();
        try{
            $user->update([
                'two_factor_status'         => $user->two_factor_status ? 0 : 1,
                'two_factor_verified'       => true,
            ]);
---
update `users` set `two_factor_verified` = 1, `two_factor_status` = 1, `users`.`updated_at` = '2024-01-01 08:51:35' where `id` = 5