app/Http/Controllers/User/SellCryptoController.php

select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (9) order by `id` desc
select * from `outside_wallet_addresses` where `outside_wallet_addresses`.`id` = 2 limit 1
---
    public function paymentInfoStore(Request $request,$identifier){
        $request->merge(['identifier' => $identifier]);
        $tempDataValidate = Validator::make($request->all(),[
            'identifier'        => "required|string|exists:temporary_datas",
        ])->validate();

        $temp_data = TemporaryData::search($tempDataValidate['identifier'])->first();

        if(!$temp_data || $temp_data->data == null || !isset($temp_data->data->payment_method->id)) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Invalid request']]);
        $gateway_currency = PaymentGatewayCurrency::find($temp_data->data->payment_method->id);

        if(!$gateway_currency || !$gateway_currency->gateway->isManual()) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Selected gateway is invalid']]);
        $outside_address     = OutsideWalletAddress::find($temp_data->data->outside_address->id);