app/Http/Controllers/User/SellCryptoController.php

select * from `currencies` where `status` = 1 order by `id` asc
select * from `currencies` where `status` = 1 limit 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1)
---
    public function index(){
        $page_title         = "- Sell Crypto";
        $currencies         = Currency::with(['networks'])->where('status',true)->orderBy('id')->get();
        $first_currency     = Currency::where('status',true)->first();
        $payment_gateway    = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->get();

select * from `currencies` where `currencies`.`id` = '1' limit 1
select * from `networks` where `networks`.`id` in (4, 5)
---
    public function getCurrencyNetworks(Request $request){
        $validator    = Validator::make($request->all(),[
            'currency'  => 'required|integer',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors()->all());
        }

        $currency  = Currency::with(['networks' => function($network) {
            $network->with(['network']);
        }])->find($request->currency);

select exists(select * from `outside_wallet_addresses` where `currency_id` = '1' and `network_id` = '5') as `exists`
---
            $amount             = $validated['amount'];
            $wallet_currency    = $validated['sender_currency'];

            if (!OutsideWalletAddress::where('currency_id', $validated['sender_currency'])
                ->where('network_id', $validated['network'])
                ->exists()) {

select * from `networks` where `id` = '5' limit 1
select * from `currencies` where `currencies`.`id` = 1 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (8) order by `id` desc
---
            })->active()->first();


            $network            = Network::where('id',$validated['network'])->first();

            $payment_gateway_currency   = PaymentGatewayCurrency::where('id',$validated['payment_method'])->whereHas('gateway', function ($gateway) {
                $gateway->where('slug', PaymentGatewayConst::money_out_slug())->where('status', 1);
            })->first();

select * from `temporary_datas` where `identifier` = 'ab3ff2a5-d206-4e7f-bd92-4a76bd9ae8bb' limit 1
select * from `outside_wallet_addresses` where `currency_id` = 1 and `network_id` = 5 limit 1
---
    public function sellPayment($identifier){
        $page_title                 = "- Sell Crypto Payment";
        $data                       = TemporaryData::where('identifier',$identifier)->first();
        if(!$data) return back()->with(['error' => ['Data not found!']]);
        $outside_wallet_address     = OutsideWalletAddress::where('currency_id',$data->data->sender_wallet->currency_id)
                                        ->where('network_id',$data->data->network->id)->first();

select * from `temporary_datas` where `identifier` = '2692dbfe-ec36-4508-9f30-9dc3b7ff2458' limit 1
---
    public function sellPaymentStore(Request $request,$identifier){
        $temp_data          = TemporaryData::where('identifier',$identifier)->first();

select * from `temporary_datas` where `identifier` = 'c7a069af-064c-4e84-b996-77e8a3b10a26' limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 10 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (10) order by `id` desc
---
    public function paymentInfo($identifier){
        $page_title = "- Payment Info";
        $data       = TemporaryData::where('identifier',$identifier)->first();

        if(!$data || $data->data == null || !isset($data->data->payment_method->id)) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Invalid request']]);
        $gateway_currency = PaymentGatewayCurrency::find($data->data->payment_method->id);
        if(!$gateway_currency || !$gateway_currency->gateway->isManual()) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Selected gateway is invalid']]);

select * from `temporary_datas` where `identifier` = '6c1ee693-3a9c-47de-b8cd-a69c9b48e44e' limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 10 limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (10) order by `id` desc
---
    public function paymentInfoStore(Request $request,$identifier){
        $request->merge(['identifier' => $identifier]);
        $tempDataValidate = Validator::make($request->all(),[
            'identifier'        => "required|string|exists:temporary_datas",
        ])->validate();

        $temp_data = TemporaryData::search($tempDataValidate['identifier'])->first();

        if(!$temp_data || $temp_data->data == null || !isset($temp_data->data->payment_method->id)) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Invalid request']]);
        $gateway_currency = PaymentGatewayCurrency::find($temp_data->data->payment_method->id);

        if(!$gateway_currency || !$gateway_currency->gateway->isManual()) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Selected gateway is invalid']]);

select * from `temporary_datas` where `identifier` = 'b6c73ed7-cc07-48cc-bfe4-34f1b0d54bf8' limit 1
select * from `payment_gateway_currencies` where `id` = 8 limit 1
---
    public function preview($identifier){
        $page_title     = "- Sell Crypto Preview";
        $data           = TemporaryData::where('identifier',$identifier)->first();
        if(!$data) return back()->with(['error' => ['Data not found!']]);
        $payment_gateway_currency  = PaymentGatewayCurrency::where('id',$data->data->payment_method->id)->first();
        if(!$payment_gateway_currency) return redirect()->route('user.sell.crypto.index')->with(['error' => ['Payment Gateway Currency not found right now. Please try with another payment gateway']]);