app/Http/Controllers/User/SupportTicketController.php

select * from `users` where `users`.`id` in (1)
---
            }
        }

        return redirect()->route('user.support.ticket.index')->with(['success' => ['Support ticket created successfully!']]);

select * from `support_tickets` where `support_tickets`.`id` = 1 limit 1
---
    public function conversation($encrypt_id)
    {
        $page_title        = " | Conversation";
        $breadcrumb        = "Conversation";
        $support_ticket_id = decrypt($encrypt_id);
        $support_ticket    = SupportTicket::findOrFail($support_ticket_id);

insert into `support_chats` (`support_ticket_id`, `sender`, `sender_type`, `message`, `receiver_type`, `updated_at`, `created_at`) values (1, 1, 'USER', 'jkhfg', 'ADMIN', '2023-11-15 07:13:50', '2023-11-15 07:13:50')
---
    public function messageSend(Request $request) {
        $validator = Validator::make($request->all(),[
            'message'       => 'required|string|max:200',
            'support_token' => 'required|string',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors(),null,400);
        }
        $validated = $validator->validate();

        $support_ticket = SupportTicket::notSolved($validated['support_token'])->first();
        if(!$support_ticket) return Response::error(['error' => ['This support ticket is closed.']]);

        $data = [
            'support_ticket_id'         => $support_ticket->id,
            'sender'                    => auth()->user()->id,
            'sender_type'               => "USER",
            'message'                   => $validated['message'],
            'receiver_type'             => "ADMIN",
        ];

        try{
            $chat_data = SupportChat::create($data);