app/Http/Controllers/User/TransactionController.php

select * from `transactions` where `user_id` = 1 and `type` = 'Buy Crypto' order by `id` desc
---
    public function buyLog(){
        $page_title  = "- Buy Logs";
        $transactions = Transaction::where("type",PaymentGatewayConst::BUY_CRYPTO)->orderBy('id','desc')->get();

select * from `transactions` where `type` = 'Sell Crypto' order by `id` desc
---
    public function sellLog(){
        $page_title     = "- Sell Logs";
        $transactions   = Transaction::where("type",PaymentGatewayConst::SELL_CRYPTO)->orderBy('id','desc')->get();

select * from `transactions` where `type` = 'Exchange Crypto' order by `id` desc
---
    public function exchangeLog(){
        $page_title     = "- Exchange Logs";
        $transactions   = Transaction::where('type',PaymentGatewayConst::EXCHANGE_CRYPTO)->orderBy('id','desc')->get();

select * from `transactions` where `user_id` = 1 and `type` = 'Buy Crypto'
---
    public function buyLogSearch(Request $request){
        $validator = Validator::make($request->all(),[
            'search_text'  => 'nullable|string',
        ]);

        if($validator->fails()) {
            return Response::error($validator->errors(),null,400);
        }

        $validated = $validator->validate();
        try{
            if($validated['search_text'] != "" || $validated['search_text'] != null){
                $transaction    = Transaction::auth()->where('type',PaymentGatewayConst::BUY_CRYPTO)
                                    ->search($validated['search_text'])->get();
            }else{
                $transaction    = Transaction::auth()->where('type',PaymentGatewayConst::BUY_CRYPTO)->get();