app/Http/Controllers/User/WalletController.php

    public function walletDetails($public_address){
        $wallet     = UserWallet::with(['currency'])->where('public_address',$public_address)->first();
        if(!$wallet) return back()->with(['error' => ['Wallet not found!']]);
        $qr_code        = generateQr($wallet->public_address);

        $get_total_networks     = CurrencyHasNetwork::where('currency_id',$wallet->currency_id)->pluck('network_id');
        $network_names  = Network::whereIn('id',$get_total_networks)->pluck('name');
---
select * from `currencies` where `currencies`.`id` in (2)
select * from `user_wallets` where `public_address` = 'SKdGQwxjVutXXDwzYljedJZwPQMMKpM8c5JE3TTWAq' limit 1
select * from `currencies` where `currencies`.`id` in (1)
select * from `user_wallets` where `user_id` = 1 and `public_address` = 'UDvKaw1sSoyGF7yicaAHCZJpoC6drqm6XOMkgByyG1' limit 1
select `network_id` from `currency_has_networks` where `currency_id` = 2
select `network_id` from `currency_has_networks` where `currency_id` = 1
select `name` from `networks` where `id` in (2, 3)