app/Http/Controllers/User/WithdrawCryptoController.php

    public function index(){
        $page_title         = "- Withdraw Crypto";
        $currencies         = UserWallet::auth()->with(['currency'])->get();
        $transaction_fees   = TransactionSetting::where('slug','withdraw')->first();
---
select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4)
select * from `user_wallets` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'withdraw' limit 1

    public function checkWalletAddress(Request $request){
        $validator    = Validator::make($request->all(),[
            'wallet_address'  => 'required',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors()->all());
        }
        $wallet_address     = $request->wallet_address;
        $wallet['data']     = UserWallet::with(['currency'])->where('public_address',$wallet_address)->first();
        $user               = UserWallet::auth()->where('public_address',$wallet_address)->first();
---
select * from `user_wallets` where `user_id` = 2 and `public_address` = 'E7BJJrON7HsVSvwe5CPScs8UT5qoyqwbvrcp92RsQ9' limit 1
select * from `currencies` where `currencies`.`id` in (3)
select * from `user_wallets` where `public_address` = 'oaqbtfzeMpOTBBDGD9j6WxZ5DXSvvWUwMc2FDU31Fc' limit 1

    public function preview($identifier){
        $page_title     = '- Withdraw Crypto Preview';
        $data           = TemporaryData::where('identifier',$identifier)->first();
---
select * from `temporary_datas` where `identifier` = '83e141ed-a5aa-4bbe-a557-a4d5bba9b47d' limit 1

    public function confirm(Request $request,$identifier){
        $basic_setting      = BasicSettings::first();
        $user               = auth()->user();
        $data               = TemporaryData::where('identifier',$identifier)->first();
        if(!$data) return back()->with(['error' => ['Data not found!']]);

        $trx_id             = generateTrxString("transactions","trx_id","WC",8);
        $wallet_id          = $data->data->sender_wallet->id;
        $sender_wallet      = UserWallet::auth()->where("id",$wallet_id)->first();
        $receiver_wallet    = UserWallet::where('public_address',$data->data->receiver_wallet->address)->first();
---
select * from `basic_settings` limit 1
select * from `temporary_datas` where `identifier` = '2a777ab4-95c0-44ed-b92e-38a341ed8070' limit 1
select * from `user_wallets` where `user_id` = 1 and `id` = 2 limit 1
select * from `user_wallets` where `public_address` = '2AbqSybjgiYxN5VKxSaYZsEN1uz7pcqEwOvlOS7JCs' limit 1

    function updateSenderWalletBalance($sender_wallet,$available_balance){
        $sender_wallet->update([
            'balance'   => $available_balance,
        ]);
---
update `user_wallets` set `balance` = 19.9, `user_wallets`.`updated_at` = '2024-01-17 03:56:37' where `id` = 2

    function updateReceiverWalletBalance($receiver_wallet,$amount){
        $update_balance = $receiver_wallet->balance + $amount;
        $receiver_wallet->update([
            'balance'   => $update_balance,
        ]);
---
update `user_wallets` set `balance` = 25345.18, `user_wallets`.`updated_at` = '2024-01-17 03:56:37' where `id` = 7

    function userNotification($data){
        UserNotification::create([
            'user_id'       => auth()->user()->id,
            'message'       => [
                'title'     => "Withdraw Crypto",
                'wallet'    => $data->data->sender_wallet->name,
                'code'      => $data->data->sender_wallet->code,
                'amount'    => $data->data->amount,
                'status'    => global_const()::STATUS_PENDING,
                'success'   => "Successfully Request Send."
            ],
        ]);
---
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '{\"title\":\"Withdraw Crypto\",\"wallet\":\"Ethereum\",\"code\":\"ETH\",\"amount\":\"10\",\"status\":1,\"success\":\"Successfully Request Send.\"}', '2024-01-17 03:56:37', '2024-01-17 03:56:37')

    function transactionDevice($transaction){
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);
        $agent = new Agent();
        $mac = "";

        DB::beginTransaction();
        try{
            DB::table("transaction_devices")->insert([
                'transaction_id'=> $transaction->id,
                'ip'            => $client_ip,
                'mac'           => $mac,
                'city'          => $location['city'] ?? "",
                'country'       => $location['country'] ?? "",
                'longitude'     => $location['lon'] ?? "",
                'latitude'      => $location['lat'] ?? "",
                'timezone'      => $location['timezone'] ?? "",
                'browser'       => $agent->browser() ?? "",
                'os'            => $agent->platform() ?? "",
            ]);
---
insert into `transaction_devices` (`transaction_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`) values (10, '::1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows')