app/Http/Helpers/helpers.php

select exists(select * from `admin_has_roles` where exists (select * from `admin_roles` where `admin_has_roles`.`admin_role_id` = `admin_roles`.`id` and `name` = 'Super Admin')) as `exists`
---
function system_super_admin()
{
    if (AdminHasRole::whereHas('role', function ($query) {
        $query->where("name", AdminRoleConst::SUPER_ADMIN);
    })->exists()) return true;

select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')
---
function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();

delete from `user_authorizations` where `user_id` = 12
insert into `user_authorizations` (`user_id`, `code`, `token`, `created_at`) values (12, '966641', 'WMaKS1p5DCKtQibZN75v8MENwnhd7GkdA5wGSeWrrW', '2023-12-17 09:36:21')
---
function mailVerificationTemplate($user) {
    $data = [
        'user_id'       => $user->id,
        'code'          => generate_random_code(),
        'token'         => generate_unique_string("user_authorizations","token",200),
        'created_at'    => now(),
    ];



    DB::beginTransaction();
    try{
        UserAuthorization::where("user_id",$user->id)->delete();
        DB::table("user_authorizations")->insert($data);

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 5
---
function get_user_notifications(){
    $notifications  = UserNotification::auth()->latest()->take(5)->get();