app/Http/Helpers/helpers.php

select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
function get_user_notifications(){
    $notifications  = UserNotification::auth()->latest()->take(10)->get();