app/Http/Helpers/PaymentGateway.php

    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();
        $temporary_data     = TemporaryData::where('identifier',$validated['identifier'])->first();
        $gateway_currency   = PaymentGatewayCurrency::with(['gateway'])->where("alias",$temporary_data->data->payment_method->alias)->first();
        $wallet_currency   = UserWallet::with(['currency'])->where('id',$temporary_data->data->wallet->wallet_id)->first();
---
select * from `temporary_datas` where `identifier` = '1b5af5fe-ef62-4a50-812e-73baf0927713' limit 1
select * from `currencies` where `currencies`.`id` in (1)
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (1) order by `id` desc
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (7) order by `id` desc
select * from `user_wallets` where `id` = 1 limit 1

    public function chargeCalculate($currency,$receiver_currency = null) {
        $temporary_data     = TemporaryData::where('identifier',$this->request_data['identifier'])->first();

        if($this->predefined_user_wallet) {
            $user_wallet = $this->predefined_user_wallet;
        }else{
            $user_wallet    =  UserWallet::auth()->whereHas("currency",function($q) use ($temporary_data) {
                $q->where("id",$temporary_data->data->wallet->wallet_id)->active();
            })->active()->first();
---
select * from `temporary_datas` where `identifier` = '1b5af5fe-ef62-4a50-812e-73baf0927713' limit 1
select * from `currencies` where `currencies`.`id` = 1 limit 1

    public function responseReceive() {
        $tempData = $this->request_data;

        if(empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction failed. Record didn\'t saved properly. Please try again.');

        if($this->requestIsApiUser()) {
            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;
            $creator_guard = $tempData['data']->creator_guard ?? null;

            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');

            if($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception('Request user doesn\'t save properly. Please try again');
            $creator = DB::table($creator_table)->where("id",$creator_id)->first();
            if(!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");

            $api_user_login_guard = $api_authenticated_guards[$creator_guard];
            $this->output['api_login_guard'] = $api_user_login_guard;
            Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
        }

        $currency_id = $tempData['data']->currency ?? "";
        $gateway_currency = PaymentGatewayCurrency::find($currency_id);
---
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 1 limit 1