app/Http/Controllers/Api/V1/SettingController.php

select * from `basic_settings` order by `id` asc
select * from `currencies` where `default` = 1 order by `id` asc
---
    public function basicSettings(){
        $basic_settings     = BasicSettings::orderBy("id")->get()->map(function($data){
            return [
                'id'                => $data->id,
                'site_name'         => $data->site_name,
                'base_color'        => $data->base_color,
                'site_logo_dark'    => $data->site_logo_dark,
                'site_logo'         => $data->site_logo,
                'site_fav_dark'     => $data->site_fav_dark,
                'site_fav'          => $data->site_fav,
                'created_at'        => $data->created_at,
            ];
        });
        $default_currency     = Currency::where('default',true)->orderBy("id")->get()->map(function($data){
            return [
                'id'                => $data->id,
                'country'           => $data->country,
                'name'              => $data->name,
                'code'              => $data->code,
                'symbol'            => $data->symbol,
            ];
        });

select * from `app_settings` order by `id` asc
select * from `app_onboard_screens` where `status` = 1 order by `id` asc
---

        // splash screen

        $splash_screen   = AppSettings::orderBy("id")->get()->map(function($data){

            return [
                'id'                          => $data->id,
                'version'                     => $data->version,
                'splash_screen_image'         => $data->splash_screen_image,
                'created_at'                  => $data->created_at,
            ];
        });

        // onboard screen
        $onboard_screen   = AppOnboardScreens::where('status',true)->orderBy("id")->get()->map(function($data){

            return [
                'id'                           => $data->id,
                'title'                        => $data->title,
                'sub_title'                    => $data->sub_title,
                'image'                        => $data->image,
                'status'                       => $data->status,
                'last_edit_by'                 => $data->last_edit_by,
                'created_at'                   => $data->created_at,

            ];
        });