app/Http/Controllers/Api/V1/User/BuyCryptoController.php

    public function index(Request $request){
        $user                           = auth()->user();
        $wallet_type                    = ['Inside Wallet','Outside Wallet'];
        $currencies                     = Currency::where('status',true)->orderBy('id')->get()->map(function($data){
            $networks                   = CurrencyHasNetwork::where('currency_id',$data->id)->get()->map(function($item){
                return [
                    'id'                => $item->id,
                    'currency_id'       => $item->currency_id,
                    'network_id'        => $item->network_id,
                    'name'              => $item->network->name,
                    'arrival_time'      => $item->network->arrival_time
                ];
            });

            $wallet                     = UserWallet::auth()->where('currency_id',$data->id)->get()->map(function($item){
                return [
                    'id'                => $item->id,
                    'user_id'           => $item->user_id,
                    'currency_id'       => $item->currency_id,
                    'public_address'    => $item->public_address,
                    'balance'           => $item->balance
                ];
            });

---
select * from `currencies` where `status` = 1 order by `id` asc
select * from `networks` where `networks`.`id` = 5 limit 1
select * from `currency_has_networks` where `currency_id` = 1
select * from `user_wallets` where `user_id` = 1 and `currency_id` = 1

        });


        $payment_gateway    = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::payment_method_slug());
            $gateway->where('status', 1);
        })->get();
---
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'payment-method' and `status` = 1)