app/Http/Controllers/Api/V1/User/WithdrawCryptoController.php

    public function store(Request $request){
        $validator           = Validator::make($request->all(),[
            'amount'            => 'required',
            'sender_wallet'     => 'required',
            'wallet_address'    => 'required',
        ]);
        if($validator->fails()) return Response::error($validator->errors()->all(),[]);

        $validated          = $validator->validate();
        $amount             = $validated['amount'];
        $sender_wallet      = UserWallet::with(['currency'])->where('id',$validated['sender_wallet'])->first();
        if(!$sender_wallet) return Response::error(['Wallet not found!'],[],404);

        $user               = UserWallet::auth()->where('public_address',$validated['wallet_address'])->first();
---
select * from `currencies` where `currencies`.`id` in (2)
select * from `user_wallets` where `public_address` = '4F2dDzZM8n1j52sdjyqu7cBwt1Od9gMcsJ5pEsJPdo' limit 1