app/Http/Controllers/User/Auth/ForgotPasswordController.php

select * from `user_password_resets` where `token` = 'EN5GDAEbciGXiXCmBomTAy5wWubjr8jveNrTt1PPzlNjwJv1R9VKGTbh7FMWzxOqVVVdZrmiWmEAFYHV' limit 1
---
    public function showVerifyForm($token) {
        $page_title = "- Verify User";
        $password_reset = UserPasswordReset::where("token",$token)->first();