app/Http/Controllers/User/Auth/LoginController.php

    protected function authenticated(Request $request, $user)
    {
        $user->two_factor_verified = 0;
        $user->save();
---
update `users` set `two_factor_verified` = 0, `users`.`updated_at` = '2024-01-18 09:22:56' where `id` = 6