app/Models/Admin/Currency.php

    public function getEditDataAttribute() {
        $role = "";
        if($this->sender == true && $this->receiver == true) {
            $role = "both";
        }else if($this->sender == true && $this->receiver == false) {
            $role = "sender";
        }else if($this->receiver == true && $this->sender == false) {
            $role = "receiver";
        }
        $networks       = CurrencyHasNetwork::with(['network'])->where('currency_id',$this->id)->get();
        $all_networks   = Network::orderByDesc('id')->get();
        $data = [
            'id'        => $this->id,
            'name'      => $this->name,
            'code'      => $this->code,
            'flag'      => $this->flag,
            'role'      => $role,
            'option'    => ($this->default == true) ? 1 : 0,
            'symbol'    => $this->symbol,
            'type'      => $this->type,
            'rate'      => get_amount($this->rate),
            'networks'  => $networks,
            'all_networks' => $all_networks,
            'country'   => $this->country,
        ];
---
select * from `currency_has_networks` where `currency_id` = 1
select * from `networks` where `networks`.`id` in (4, 5)
select * from `networks` order by `id` desc
select * from `networks` where `networks`.`id` in (5, 7)