app/Traits/User/LoggedInUsers.php

    protected function refreshUserWallets($user) {
        $user_wallets = $user->wallets->pluck("currency_id")->toArray();
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();

        $new_currencies = array_diff($currencies,$user_wallets);

        $new_wallets = [];
        foreach($new_currencies as $item) {
            $new_wallets[] = [
                'user_id'       => $user->id,
                'currency_id'   => $item,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        try{
            UserWallet::insert($new_wallets);
---
insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `public_address`, `status`, `user_id`) values (0, '2023-12-24 10:13:09', 1, '97aub8A1dfUR5DE58xZqkCZWVVbuAS7Oz4x7OoDU62', 1, 1), (0, '2023-12-24 10:13:09', 2, 'TncmmXA9ZoHSxqcfQQrQ3kA83gmilnOZbBjnp1xU7f', 1, 1), (0, '2023-12-24 10:13:09', 3, 'fQ3EDRnlmveFSp2kOupTpmaBS4Yyx2doSVH5XWgbp8', 1, 1), (0, '2023-12-24 10:13:09', 4, 'mAn5qWDfQN62zOl9s3ryVEz5tEW9j1Z9hOOxEqWrDj', 1, 1)

    protected function createLoginLog($user) {
        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent();

        $mac = "";

        $data = [
            'user_id'       => $user->id,
            'ip'            => $client_ip,
            'mac'           => $mac,
            'city'          => $location['city'] ?? "",
            'country'       => $location['country'] ?? "",
            'longitude'     => $location['lon'] ?? "",
            'latitude'      => $location['lat'] ?? "",
            'timezone'      => $location['timezone'] ?? "",
            'browser'       => $agent->browser() ?? "",
            'os'            => $agent->platform() ?? "",
        ];

        try{
            UserLoginLog::create($data);
---
insert into `user_login_logs` (`user_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (2, '::1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows', '2023-11-15 04:39:36', '2023-11-15 04:39:36')