app/Models/SupportTicket.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function getCreatorAttribute() {
        if($this->type == SupportTicketConst::TYPE_USER) {
            return $this->user()->first();