app/Models/User.php

select count(*) as aggregate from `user_login_logs` where `user_login_logs`.`user_id` = 1 and `user_login_logs`.`user_id` is not null
---
    public function getLastLoginAttribute() {
        if($this->loginLogs()->count() > 0) {