app/Http/Controllers/Admin/AdminCareController.php

    public function index()
    {
        $page_title = "All Admin";
        $admins = Admin::paginate(10);
---
select * from `admins` limit 10 offset 0
select count(*) as aggregate from `admins`