app/Http/Controllers/Admin/BlogCategoryController.php

    public function update(Request $request){
        $request->validate([
            'target'         =>'required|string',
        ]);
        $basic_field_name = [
            'name'  => "required",
        ];

        $category   = BlogCategory::where('id',$request->target)->first();
---
select * from `blog_categories` where `id` = '4' limit 1

    public function contentValidate($request,$basic_field_name,$modal = null) {
        $languages = Language::get();
---
select * from `languages`