app/Http/Controllers/Admin/BuyCryptoLogController.php

    public function index(){
        $page_title     = "All Buy Crypto Logs";
        $transactions   = Transaction::where('type',PaymentGatewayConst::BUY_CRYPTO)->get();
---
select * from `transactions` where `type` = 'Buy Crypto' order by `id` desc