app/Http/Controllers/Admin/CoinController.php

select exists(select * from `coins` where `slug` = 'btc') as `exists`
---
    public function store(Request $request){
        $validator     = Validator::make($request->all(),[
            'name'     => 'required|string',
            'title'    => 'nullable|string'
        ]);

        if($validator->fails()) return back()->withErrors($validator)->withInput()->with("modal","add-coin");

        $validated     = $validator->validate();
        $validated['slug']   = Str::slug($request->name);
        if(Coin::where('slug',$validated['slug'])->exists()){