app/Http/Controllers/Admin/CurrencyController.php

select * from `currencies` order by `default` desc limit 10 offset 0
select count(*) as aggregate from `currencies`
select * from `networks` where `status` = 1 order by `id` desc
---
    public function index()
    {
        $page_title = "Setup Currency";
        $currencies = Currency::orderByDesc('default')->paginate(10);
        $networks   = Network::where('status',true)->orderByDesc('id')->get();

select * from `currencies` where `code` = 'EUR' limit 1
update `currencies` set `status` = 1, `currencies`.`updated_at` = '2023-11-28 11:33:34' where `id` = 14
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $validated = $validator->safe()->all();
        $currency_code = $validated['data_target'];

        $currency = Currency::where('code',$currency_code)->first();
        if(!$currency) {
            $error = ['error' => ['Currency record not found in our system.']];
            return Response::error($error,null,404);
        }

        try{
            $currency->update([
                'status' => ($validated['status'] == true) ? false : true,
            ]);

select * from `currencies` where `code` = 'AFN' limit 1
select * from `currency_has_networks` where `currency_id` = 2
delete from `currency_has_networks` where `id` = 13
delete from `currencies` where `id` = 2
---
    public function delete(Request $request) {
        $validator = Validator::make($request->all(),[
            'target'        => 'required|string|exists:currencies,code',
        ]);
        $validated = $validator->validate();
        $currency = Currency::where("code",$validated['target'])->first();
        $networks   = CurrencyHasNetwork::where('currency_id',$currency->id)->get();


        if($currency->isDefault()) {
            return back()->with(['warning' => ['Can\'t deletable default currency.']]);
        }

        try{
            $currency->delete();