app/Http/Controllers/Admin/OutsideWalletAddressController.php

    public function index(){
        $page_title         = "Outside Wallet Payment Receiving Address";
        $outside_wallets    = OutsideWalletAddress::with(['currency','network'])->orderBy('id','desc')->get();
---
select * from `currencies` where `currencies`.`id` in (1, 2, 3, 4)
select * from `networks` where `networks`.`id` in (2, 3, 4, 5)
select * from `outside_wallet_addresses` order by `id` desc

    public function create(){
        $page_title         = "Outside Wallet Create";
        $currencies         = Currency::with(['networks'])->where('status',true)->orderBy('id')->get();
---
select * from `currencies` where `status` = 1 order by `id` asc

    public function getNetworks(Request $request) {

        $validator    = Validator::make($request->all(),[
            'currency'  => 'required|integer',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors()->all());
        }

        $currency  = Currency::with(['networks' => function($network) {
            $network->with(['network']);
        }])->find($request->currency);
---
select * from `currencies` where `currencies`.`id` = '2' limit 1
select * from `networks` where `networks`.`id` in (2, 3)

    public function edit($public_address){
        $page_title         = "Outside Wallet Edit";
        $currencies         = Currency::with(['networks'])->where('status',true)->orderBy('id')->get();
        $networks           = Network::where('status',true)->orderBy('id')->get();
        $data               = OutsideWalletAddress::with(['currency','network'])->where('public_address',$public_address)->first();
---
select * from `currencies` where `status` = 1 order by `id` asc
select * from `networks` where `status` = 1 order by `id` asc
select * from `currencies` where `currencies`.`id` in (3)
select * from `networks` where `networks`.`id` in (5)
select * from `outside_wallet_addresses` where `public_address` = 'yutyasdfjbsmfasjkdfjasjkfdrrrrdfsdfsklkmcnmkxdjih' limit 1

    public function delete(Request $request){
        $request->validate([
            'target'    => 'required|numeric|',
        ]);
        $outside_wallet = OutsideWalletAddress::find($request->target);

        try {
            $outside_wallet->delete();
---
select * from `outside_wallet_addresses` where `outside_wallet_addresses`.`id` = '8' limit 1
delete from `outside_wallet_addresses` where `id` = 8