app/Http/Controllers/Admin/OutsideWalletAddressController.php

    public function edit($public_address){
        $page_title         = "Outside Wallet Edit";
        $data               = OutsideWalletAddress::with(['currency','network'])->where('public_address',$public_address)->first();
        $currencies         = Currency::with(['networks'])->where('id',$data->currency_id)->where('status',true)->first();
        $networks           = CurrencyHasNetwork::with(['network'])->where('currency_id',$data->currency_id)->orderBy('id')->get();
---
select * from `currency_has_networks` where `currency_has_networks`.`currency_id` in (1, 2, 3, 4)