app/Http/Controllers/Admin/PaymentGatewaysController.php

select exists(select * from `payment_gateways` where (`slug` = 'money-out') and (`type` = 'MANUAL') and `alias` = 'adfund') as `exists`
---
    public function manualMoneyOutStore(Request $request) {

        $gateway_name = $request->gateway_name;
        $validator = Validator::make($request->all(),[
            'gateway_name'          => ['required','string','max:60',Rule::unique('payment_gateways','alias')->where(function($query) use ($gateway_name) {
                $alias = Str::slug($gateway_name);
                $query->where('slug',PaymentGatewayConst::money_out_slug())->where('type',PaymentGatewayConst::MANUAL)->where('alias',$alias);
            })],
            'desc'                  => 'nullable|string|max:10000',
            'label'                 => 'nullable|array',
            'label.*'               => 'nullable|string|max:50',
            'input_type'            => 'nullable|array',
            'input_type.*'          => 'nullable|string|max:20',
            'min_char'              => 'nullable|array',
            'min_char.*'            => 'nullable|numeric',
            'max_char'              => 'nullable|array',
            'max_char.*'            => 'nullable|numeric',
            'field_necessity'       => 'nullable|array',
            'field_necessity.*'     => 'nullable|string|max:20',
            'file_extensions'       => 'nullable|array',
            'file_extensions.*'     => 'nullable|string|max:255',
            'file_max_size'         => 'nullable|array',
            'file_max_size.*'       => 'nullable|numeric',
            'image'                 => 'nullable|image|mimes:jpg,png,svg,jpeg,webp',
            'currency_code'         => 'required|string|max:10',
        ]);

        $validator->after(function ($validator) use ($gateway_name) {
            // Search Gateway is unique or not
            if(PaymentGateway::moneyOut()->manual()->gateway(Str::slug($gateway_name))->exists()) {

select max(`code`) as aggregate from `payment_gateways`
---
        $validated['last_edit_by']          = Auth::user()->id;
        $validated['supported_currencies']  = [$validated['currency_code']];

        $last_record_of_max_code = PaymentGateway::max('code') ?? 100;

insert into `payment_gateways` (`desc`, `alias`, `name`, `slug`, `title`, `type`, `last_edit_by`, `supported_currencies`, `code`, `input_fields`) values ('<p><span style=\"background-color:rgb(52,53,65);color:rgb(209,213,219);\">A network refers to a system of interconnected elements or entities that communicate and interact with each other. In the realm of technology, a network commonly denotes the interconnection of computers, devices, or systems to facilitate the exchange of information and resources.</span></p>', 'adfund', 'ADFund', 'money-out', 'ADFund Gateway', 'MANUAL', 1, '[\"USD\"]', 225, '[{\"type\":\"text\",\"label\":\"trx_id\",\"name\":\"trx_id\",\"required\":true,\"validation\":{\"max\":\"30\",\"mimes\":[],\"min\":\"0\",\"options\":[],\"required\":true}}]')
---
        try{
            $validated['input_fields']  = json_encode($validated['input_fields']);
            $validated['supported_currencies'] = json_encode($validated['supported_currencies']);
            $payment_gateway_id = PaymentGateway::insertGetId($validated);

insert into `payment_gateway_currencies` (`min_limit`, `max_limit`, `fixed_charge`, `percent_charge`, `rate`, `currency_code`, `currency_symbol`, `name`, `alias`, `payment_gateway_id`, `updated_at`, `created_at`) values ('45218', '45218000', '2', '2', '45218', 'USD', '$', 'ADFund USD', 'money-out-adfund-usd-manual', 10, '2024-01-02 10:02:31', '2024-01-02 10:02:31')
---

        // insert gateway currency
        try{
            PaymentGatewayCurrency::create($currency_validated);