app/Http/Controllers/Admin/SellCryptoLogController.php

    public function details($id){
        $page_title     = "Sell Crypto Log Details";
        $transaction    = Transaction::with(['user','user_wallets','currency'])->where('id',$id)->first();
        $transaction_device = TransactionDevice::where('transaction_id',$id)->first();
---
select * from `transactions` where `id` = '19' limit 1
select * from `user_wallets` where `user_wallets`.`id` in (1)
select * from `users` where `users`.`id` in (1)
select * from `transaction_devices` where `transaction_id` = '19' limit 1