app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages = Language::get();
---
select * from `languages`

    public function bannerUpdate(Request $request,$slug) {
        $basic_field_name   = [
            'title'         => "required|string|max:100",
            'heading'       => "required|string|max:100",
            'sub_heading'   => "required|string|max:255",
            'button_name'   => "required|string|max:50",
        ];

        $slug = Str::slug(SiteSectionConst::BANNER_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'security-section' limit 1

        $update_data['key']    = $slug;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
update `site_sections` set `value` = '{\"button_link\":\"https:\/\/www.youtube.com\/embed\/7p6hG3plQj4?si=GdtHRzd7M2wXWRva\",\"language\":{\"en\":{\"title\":\"New era of financial innovation\",\"heading\":\"Make your\",\"sub_heading\":\"Cryptocurrencies have introduced a new era of financial innovation, offering opportunities and challenges. As the technology continues to evolve, their impact on various industries.\",\"button_name\":\"Explore Now\"},\"es\":{\"title\":null,\"heading\":null,\"sub_heading\":null,\"button_name\":null}},\"image\":\"seeder\/banner.webp\",\"button_image\":\"seeder\/button.webp\"}', `site_sections`.`updated_at` = '2023-11-26 07:09:47' where `id` = 3
select * from `site_sections` where `key` = 'security-section' limit 1

    public function securityItemDelete(request $request,$slug){
        $request->validate([
            'target'    =>'required|string',
        ]);

        $slug           = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $section        = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);

        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
---
select * from `site_sections` where `key` = 'download-app' limit 1

    public function securityStatusUpdate(Request $request,$slug) {

        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            return Response::error($validator->errors()->all(),null,400);
        }

        $slug           = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $section        = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'how-its-work-section' limit 1

        $update_data['key']     = $slug;
        $update_data['value']   = $section_data;
        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'how-its-work-section' limit 1

    public function statisticItemStore(Request $request,$slug) {
        $basic_field_name   = [
            'title'       => "required|string|max:255",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"statistic-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug    = Str::slug(SiteSectionConst::STATISTIC_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'statistic-section' limit 1

        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'download-app' limit 1

    public function callToActionUpdate(Request $request,$slug) {
        $basic_field_name   = [
            'heading'       => "required|string|max:100",
            'sub_heading'   => "required|string|max:255",
            'button_name'   => "required|string|max:50",
        ];

        $slug = Str::slug(SiteSectionConst::CALL_TO_ACTION_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'footer-section' limit 1

    public function newsLetterUpdate(Request $request,$slug) {

        $basic_field_name    = [
            'title'          => 'required|string|max:100',
            'description'    => 'required|string',

        ];
        $slug           = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $section        = SiteSections::where("key",$slug)->first();
        if($section != null ){
            $data       = json_decode(json_encode($section->value),true);
        }else{
            $data       = [];
        }

        $data['language']      = $this->contentValidate($request,$basic_field_name);
        $update_data['key']    = $slug;
        $update_data['value']  = $data;
        // dd($update_data);
        try{
            SiteSections::updateOrCreate(['key'=>$slug],$update_data);
---
select * from `site_sections` where `key` = 'about-section' limit 1