app/Http/Controllers/Admin/UserCareController.php

select * from `users` where `username` = 'testuser' limit 1
---
    public function userDetails($username)
    {
        $page_title             = "User Details";
        $user                   = User::where('username', $username)->first();

select * from `users` where `username` = 'warren' limit 1
---
    public function loginAsMember(Request $request,$username) {
        $request->merge(['username' => $username]);
        $request->validate([
            'target'            => 'required|string|exists:users,username',
            'username'          => 'required_without:target|string|exists:users',
        ]);

        try{
            $user = User::where("username",$request->username)->first();