app/Http/Controllers/Admin/WithdrawCryptoLogController.php

select * from `transactions` where `type` = 'Withdraw Crypto' order by `id` desc
---
    public function index(){
        $page_title     = "All Withdraw Crypto Logs";
        $transactions   = Transaction::where('type',PaymentGatewayConst::WITHDRAW_CRYPTO)->orderBy('id','desc')->get();

select * from `user_wallets` where `user_wallets`.`id` in (2)
select * from `users` where `users`.`id` in (1)
---
    public function statusUpdate(Request $request,$trx_id){
        $basic_setting  = BasicSettings::first();
        $validator = Validator::make($request->all(),[
            'status'            => 'required|integer',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();
        $transaction   = Transaction::with(['user','user_wallets'])->where('trx_id',$trx_id)->first();